configuring-constant-lang-variable.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-07-26 Tue 23:16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Configuring constant LANG variable</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:title" content="Configuring constant LANG variable">
<meta property="og:description" content="">
<meta property="description" content="">
<meta property="og:image" content="https://notes.neeasade.net/assets/img/backgrounds/warm.png">
<meta property="og:url" content="https://notes.neeasade.net/configuring-constant-lang-variable.html">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='/assets/css/colors.css?sum=abd38449620b2223dffce2c948aae610'>
<link rel='stylesheet' href='./assets/css/colors.css?sum=abd38449620b2223dffce2c948aae610'>
<link rel='stylesheet' href='/assets/css/new.css?sum=4868ab8522b4e4059bfc5213fd799d61'>
<link rel='stylesheet' href='./assets/css/new.css?sum=4868ab8522b4e4059bfc5213fd799d61'>
<link rel='stylesheet' href='/assets/css/org.css?sum=19824060f71383b34e196f76ea8c38f1'>
<link rel='stylesheet' href='./assets/css/org.css?sum=19824060f71383b34e196f76ea8c38f1'>
<link rel='stylesheet' href='/assets/css/notes.css?sum=7f1e0aaa36371b978c44c8839ba3713f'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=7f1e0aaa36371b978c44c8839ba3713f'>
</head>
<body>
<div id="content" class="content">
<div style="float: left">
    <a href='/index.html'>Up: arst wow</a>
</div>

<div style="float: right">
    <a href="https://github.com/neeasade/neeasade.github.io/commits/source/posts/2014-02-21-configuring-constant-lang-variable.org">Last edit: <2019-02-24></a>
</div>

<p>
<h1 class=title>Configuring constant LANG variable</h1>
</p>


<hr>

<p>
After setting your correct locale in the etc/locale.gen file and running
locale-gen, your system wide language gets set in Linux. Some
applications, however, reference the LANG variable in order to determine
language type. One in particular that I am fond of is sublime text. This
isn&rsquo;t an issue until you install the package manager - which you will
probably want to do eventually.
</p>

<p>
A temporary fix, as the error logged will inform you, is to set the LANG
variable either before or with the startup of sublime text.
</p>

<p>
However, this may not always be viable, and can be annoying. There are
two solutions to set this variable upon system startup.
</p>

<p>
A &ldquo;hacky&rdquo; way to get around this problem would be to set the LANG
variable within your .bashrc file, as such:
</p>

<blockquote>
<p>
export LANG =&ldquo;en\<sub>US.UTF</sub>-8&rdquo;
</p>
</blockquote>

<p>
However, the above only sets the variable for your user/login session.
</p>

<p>
To set the LANG variable system wide(the prefferred method), edit or
create the file /etc/locale.conf to contain:
</p>

<blockquote>
<p>
LANG =&ldquo;en\<sub>US.UTF</sub>-8&rdquo;
</p>
</blockquote>

<p>
And upon restart your LANG variable will be set correctly.
</p>


<p>
<div class='flair'></div>
</p>

<div class='footer-left'>
    <a href='/index.html'>arst wow</a>
</div>

<p>
<div class=footer-center>type: post</div>
</p>

<div class="footer-right">
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/2014-02-21-configuring-constant-lang-variable.org">Page Markup</a>
</div>
</div>
</body>
</html>
